Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: لاهية قلوبهم وأسروا النجوى الذين ظلموا هل هذا إلا بشر مثلكم أفتأتون السحر وأنتم تبصرون
en: With their hearts occupied (with evil things). Those who do wrong, conceal their private counsels, (saying): "Is this (Muhammad صلى الله عليه وسلم) more than a human being like you? Will you submit to magic while you see it?"

source: قال ربي يعلم القول في السماء والأرض وهو السميع العليم
en: He (Muhammad صلى الله عليه وسلم) said: "My Lord knows (every) word (spoken) in the heavens and on earth. And He is the All-Hearer, the All-Knower."

source: بل قالوا أضغاث أحلام بل افتراه بل هو شاعر فليأتنا بآية كما أرسل الأولون
en: Nay, they say: "These (revelations of the Qur'an which are revealed to Muhammad صلى الله عليه وسلم) are mixed up false dreams! Nay, he has invented them! - Nay, he is a poet! Let him then bring us an Ayah (sign as a proof) like the ones (Prophets) the former were sent (with)!"

source: ما آمنت قبلهم من قرية أهلكناها أفهم يؤمنون
en: Not one of the towns (populations), of those which We destroyed, believed before them (though We sent them signs): will they then believe?

source: وما أرسلنا قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not before you (O Muhammad صلى الله عليه وسلم) but men to whom We revealed. So ask the people of the Reminder [Scriptures - the Taurat (Torah), the Injeel (Gospel)] if you do not know.

source: وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين
en: And We did not create them (the Messengers, with) bodies that ate not food, nor were they immortals.

source: ثم صدقناهم الوعد فأنجيناهم ومن نشاء وأهلكنا المسرفين
en: Then We fulfilled to them the promise. So We saved them and those whom We willed, but We destroyed Al-Musrifun (i.e. disbelievers in Allah, in His Messengers, extravagants, transgressors of Allah's limits by committing crimes, oppressions, polytheism and sins).

source: لقد أنزلنا إليكم كتابا فيه ذكركم أفلا تعقلون
en: Indeed, We have sent down for you (O mankind) a Book (the Qur'an) in which there is Dhikrukum,(your Reminder or an honour for you i.e. honour for the one who follows the teaching of the Qur'an and acts on its teachings). Will you not then understand?

source: وكم قصمنا من قرية كانت ظالمة وأنشأنا بعدها قوما آخرين
en: How many a town (community) given to wrong-doing, have We destroyed, and raised up after them another people!

source: فلما أحسوا بأسنا إذا هم منها يركضون
en: Then, when they perceived (saw) Our Torment (coming), behold, they (tried to) flee from it.

source: لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون
en: Flee not, but return to that wherein you lived a luxurious life, and to your homes, in order that you may be questioned.

source: قالوا يا ويلنا إنا كنا ظالمين
en: They cried: "Woe to us! Certainly we have been Zalimun (polytheists, wrong-doers and disbelievers in the Oneness of Allah)."

source: فما زالت تلك دعواهم حتى جعلناهم حصيدا خامدين
en: And that cry of theirs ceased not, till We made them as a field that is reaped, extinct (dead).

source: وما خلقنا السماء والأرض وما بينهما لاعبين
en: We created not the heavens and the earth and all that is between them for a (mere) play.

source: لو أردنا أن نتخذ لهوا لاتخذناه من لدنا إن كنا فاعلين
en: Had We intended to take a pastime (i.e. a wife or a son), We could surely have taken it from Us, if We were going to do (that).

source: بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
en: Nay, We fling (send down) the truth (this Qur'an) against the falsehood (disbelief), so it destroys it, and behold, it (falsehood) is vanished. And woe to you for that (lie) which you ascribe (to Allah by uttering that Allah has a wife and a son).

source: وله من في السماوات والأرض ومن عنده لا يستكبرون عن عبادته ولا يستحسرون
en: To Him belongs whosoever is in the heavens and on earth. And those who are near Him (i.e. the angels) are not too proud to worship Him, nor are they weary (of His worship).

source: يسبحون الليل والنهار لا يفترون
en: They (i.e. the angels) glorify His Praises night and day, (and) they never slacken (to do so).

source: أم اتخذوا آلهة من الأرض هم ينشرون
en: Or have they taken (for worship) alihah (gods) from the earth who raise the dead?

source: لو كان فيهما آلهة إلا الله لفسدتا فسبحان الله رب العرش عما يصفون
en: Had there been therein (in the heavens and the earth) alihah (gods) besides Allah, then verily both would have been ruined. Glorified be Allah, the Lord of the Throne, (High is He) above all that (evil) they associate with Him!

source: لا يسأل عما يفعل وهم يسألون
en: He cannot be questioned as to what He does, while they will be questioned.

source: أم اتخذوا من دونه آلهة قل هاتوا برهانكم هذا ذكر من معي وذكر من قبلي بل أكثرهم لا يعلمون الحق فهم معرضون
en: Or have they taken for worship (other) alihah (gods) besides Him? Say: "Bring your proof." This (the Qur'an) is the Reminder for those with me and the Reminder for those before me. But most of them know not the Truth, so they are averse.

source: وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون
en: And We did not send any Messenger before you (O Muhammad صلى الله عليه وسلم) but We revealed to him (saying): La ilaha illa Ana [none has the right to be worshipped but I (Allah)], so worship Me (Alone and none else)."

source: وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون
en: And they say: "The Most Gracious (Allah) has begotten a son (or children)." Glory to Him! They [whom they call children of Allah i.e. the angels, 'Îsa (Jesus) - son of Maryam (Mary), 'Uzair (Ezra)], are but honoured slaves.

source: لا يسبقونه بالقول وهم بأمره يعملون
en: They speak not until He has spoken, and they act on His Command.

source: يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون
en: He knows what is before them, and what is behind them, and they cannot intercede except for him with whom He is pleased. And they stand in awe for fear of Him.

source: ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين
en: And if any of them should say: "Verily, I am an ilah (a god) besides Him (Allah)," such a one We should recompense with Hell. Thus We recompense the Zalimun (polytheists and wrong-doers).

source: أولم ير الذين كفروا أن السماوات والأرض كانتا رتقا ففتقناهما وجعلنا من الماء كل شيء حي أفلا يؤمنون
en: Have not those who disbelieve known that the heavens and the earth were joined together as one united piece, then We parted them? And We have made from water every living thing. Will they not then believe?

source: وجعلنا في الأرض رواسي أن تميد بهم وجعلنا فيها فجاجا سبلا لعلهم يهتدون
en: And We have placed on the earth firm mountains, lest it should shake with them, and We placed therein broad highways for them to pass through, that they may be guided.

source: وجعلنا السماء سقفا محفوظا وهم عن آياتها معرضون
en: And We have made the heaven a roof, safe and well guarded. Yet they turn away from its signs (i.e. sun, moon, winds, clouds, etc.).

source: وهو الذي خلق الليل والنهار والشمس والقمر كل في فلك يسبحون
en: And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.

source: وما جعلنا لبشر من قبلك الخلد أفإن مت فهم الخالدون
en: And We granted not to any human being immortality before you (O Muhammad صلى الله عليه وسلم): then if you die, would they live forever?

source: كل نفس ذائقة الموت ونبلوكم بالشر والخير فتنة وإلينا ترجعون
en: Everyone is going to taste death, and We shall make a trial of you with evil and with good. And to Us you will be returned.

source: وإذا رآك الذين كفروا إن يتخذونك إلا هزوا أهذا الذي يذكر آلهتكم وهم بذكر الرحمن هم كافرون
en: And when those who disbelieved (in the Oneness of Allah) see you (O Muhammad صلى الله عليه وسلم), they take you not except for mockery (saying): "Is this the one who talks (badly) about your gods?" While they disbelieve at the mention of the Most Gracious (Allah). [Tafsir Al-Qurtubi].

source: خلق الإنسان من عجل سأريكم آياتي فلا تستعجلون
en: Man is created of haste. I will show you My Ayat (torments, proofs, evidence, verses, lessons, signs, revelations, etc.). So ask Me not to hasten (them).

source: لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون
en: If only those who disbelieved knew (the time) when they will not be able to ward off the Fire from their faces, nor from their backs, and they will not be helped.

source: بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون
en: Nay, it (the Fire or the Day of Resurrection) will come upon them all of a sudden and will perplex them, and they will have no power to avert it nor will they get respite.

source: قل من يكلؤكم بالليل والنهار من الرحمن بل هم عن ذكر ربهم معرضون
en: Say: "Who can guard and protect you in the night or in the day from the (punishment of the) Most Gracious (Allah)?" Nay, but they turn away from the remembrance of their Lord.

source: أم لهم آلهة تمنعهم من دوننا لا يستطيعون نصر أنفسهم ولا هم منا يصحبون
en: Or have they alihah (gods) who can guard them from Us? They have no power to help themselves, nor can they be protected from Us (i.e. from Our Torment).

source: بل متعنا هؤلاء وآباءهم حتى طال عليهم العمر أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون
en: Nay, We gave the luxuries of this life to these men and their fathers until the period grew long for them. See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will overcome?

source: قل إنما أنذركم بالوحي ولا يسمع الصم الدعاء إذا ما ينذرون
en: Say (O Muhammad صلى الله عليه وسلم): "I warn you only by the revelation (from Allah and not by the opinion of the religious scholars and others). But the deaf (who follow the religious scholars and others blindly) will not hear the call, (even) when they are warned [i.e. one should follow only the Qur'an and the Sunnah (legal ways, orders, acts of worship, and the statements of Prophet Muhammad صلى الله عليه وسلم, as the companions of the Prophet صلى الله عليه وسلم did)] .

source: ولئن مستهم نفحة من عذاب ربك ليقولن يا ويلنا إنا كنا ظالمين
en: And if a breath (minor calamity) of the Torment of your Lord touches them, they will surely cry: "Woe unto us! Indeed we have been Zalimun (polytheists and wrong-doers)."

source: ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين
en: And We shall set up balances of justice on the Day of Resurrection, then none will be dealt with unjustly in anything. And if there be the weight of a mustard seed, We will bring it. And Sufficient are We to take account.

source: ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين
en: And indeed We granted to Musa (Moses) and Harun (Aaron) the criterion (of right and wrong), and a shining light [i.e. the Taurat (Torah)] and a Reminder for Al-Muttaqun (the pious - See V.2:2).

source: الذين يخشون ربهم بالغيب وهم من الساعة مشفقون
en: Those who fear their Lord without seeing Him, and they are afraid of the Hour.

source: وهذا ذكر مبارك أنزلناه أفأنتم له منكرون
en: And this is a blessed Reminder (the Qur'an) which We have sent down: will you then (dare to) deny it?

source: ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين
en: And indeed We bestowed aforetime on Ibrahim (Abraham) his (portion of) guidance, and We were Well-Acquainted with him (as to his Belief in the Oneness of Allah).

source: إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون
en: When he said to his father and his people: "What are these images, to which you are devoted?"

source: قالوا وجدنا آباءنا لها عابدين
en: They said: "We found our fathers worshipping them."

source: قال لقد كنتم أنتم وآباؤكم في ضلال مبين
en: He said: "Indeed, you and your fathers have been in manifest error."

source: قالوا أجئتنا بالحق أم أنت من اللاعبين
en: They said: "Have you brought us the truth, or are you one of those who play about?"

source: قال بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين
en: He said: "Nay, your Lord is the Lord of the heavens and the earth, Who created them and to that I am one of the witnesses.

source: وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين
en: "And by Allah, I shall plot a plan (to destroy) your idols after you have gone away and turned your backs."

source: فجعلهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون
en: So he broke them to pieces, (all) except the biggest of them, that they might turn to it.

source: قالوا من فعل هذا بآلهتنا إنه لمن الظالمين
en: They said: "Who has done this to our alihah (gods)? He must indeed be one of the Zalimun (wrong-doers)."

source: قالوا سمعنا فتى يذكرهم يقال له إبراهيم
en: They said: "We heard a young man talking against them, who is called Ibrahim (Abraham)."

source: قالوا فأتوا به على أعين الناس لعلهم يشهدون
en: They said: "Then bring him before the eyes of the people, that they may testify."

source: قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم
en: They said: "Are you the one who has done this to our gods, O Ibrahim (Abraham)?"

source: قال بل فعله كبيرهم هذا فاسألوهم إن كانوا ينطقون
en: [Ibrahim (Abraham)] said: "Nay, this one, the biggest of them (idols) did it. Ask them, if they can speak!"

source: فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون
en: So they turned to themselves and said: "Verily, you are the Zalimun (polytheists and wrong-doers)."

source: ثم نكسوا على رءوسهم لقد علمت ما هؤلاء ينطقون
en: Then they turned to themselves (their first thought and said): "Indeed you [Ibrahim (Abraham)] know well that these (idols) speak not!"

source: قال أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم
en: [Ibrahim (Abraham)] said: "Do you then worship besides Allah, things that can neither profit you, nor harm you?

source: أف لكم ولما تعبدون من دون الله أفلا تعقلون
en: "Fie upon you, and upon that which you worship besides Allah! Have you then no sense?"

source: قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين
en: They said: "Burn him and help your alihah (gods), if you will be doing."

source: قلنا يا نار كوني بردا وسلاما على إبراهيم
en: We (Allah) said: "O fire! Be you coolness and safety for Ibrahim (Abraham)!"

source: وأرادوا به كيدا فجعلناهم الأخسرين
en: And they wanted to harm him, but We made them the worst losers.

source: ونجيناه ولوطا إلى الأرض التي باركنا فيها للعالمين
en: And We rescued him and Lut (Lot) to the land which We have blessed for the 'Alamin (mankind and jinn).

source: ووهبنا له إسحاق ويعقوب نافلة وكلا جعلنا صالحين
en: And We bestowed upon him Ishaq (Isaac), and (a grandson) Ya'qub (Jacob). Each one We made righteous.

source: وجعلناهم أئمة يهدون بأمرنا وأوحينا إليهم فعل الخيرات وإقام الصلاة وإيتاء الزكاة وكانوا لنا عابدين
en: And We made them leaders, guiding (mankind) by Our Command, and We revealed to them the doing of good deeds, performing Salat (Iqamat-as-Salat), and the giving of Zakat and of Us (Alone) they were the worshippers.

source: ولوطا آتيناه حكما وعلما ونجيناه من القرية التي كانت تعمل الخبائث إنهم كانوا قوم سوء فاسقين
en: And (remember) Lut (Lot), We gave him Hukm (right judgement of the affairs and Prophethood) and (religious) knowledge, and We saved him from the town (folk) who practised Al-Khaba'ith (evil, wicked and filthy deeds). Verily, they were a people given to evil, and were Fasiqun (rebellious, disobedient to Allah).

source: وأدخلناه في رحمتنا إنه من الصالحين
en: And We admitted him to Our Mercy; truly, he was of the righteous.

source: ونوحا إذ نادى من قبل فاستجبنا له فنجيناه وأهله من الكرب العظيم
en: And (remember) Nuh (Noah), when he cried (to Us) aforetime. We answered his invocation and saved him and his family from the great distress.

source: ونصرناه من القوم الذين كذبوا بآياتنا إنهم كانوا قوم سوء فأغرقناهم أجمعين
en: We helped him against the people who denied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). Verily, they were a people given to evil. So We drowned them all.

source: وداوود وسليمان إذ يحكمان في الحرث إذ نفشت فيه غنم القوم وكنا لحكمهم شاهدين
en: And (remember) Dawud (David) and Sulaiman (Solomon), when they gave judgement in the case of the field in which the sheep of certain people had pastured at night; and We were witness to their judgement.

source: ففهمناها سليمان وكلا آتينا حكما وعلما وسخرنا مع داوود الجبال يسبحن والطير وكنا فاعلين
en: And We made Sulaiman (Solomon) to understand (the case); and to each of them We gave Hukm (right judgement of the affairs and Prophethood) and knowledge. And We subjected the mountains and the birds to glorify Our Praises along with Dawud (David). And it was We Who were the doer (of all these things).

source: وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم فهل أنتم شاكرون
en: And We taught him the making of metal coats of mail (for battles), to protect you in your fighting. Are you then grateful?

source: ولسليمان الريح عاصفة تجري بأمره إلى الأرض التي باركنا فيها وكنا بكل شيء عالمين
en: And to Sulaiman (Solomon) (We subjected) the wind strongly raging, running by his command towards the land which We had blessed. And of everything We are the All-Knower.

source: ومن الشياطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حافظين
en: And of the Shayatin (devils from the jinn) were some who dived for him, and did other work besides that; and it was We Who guarded them.

source: وأيوب إذ نادى ربه أني مسني الضر وأنت أرحم الراحمين
en: And (remember) Ayyub (Job), when he cried to his Lord: "Verily, distress has seized me, and You are the Most Merciful of all those who show mercy."

source: فاستجبنا له فكشفنا ما به من ضر وآتيناه أهله ومثلهم معهم رحمة من عندنا وذكرى للعابدين
en: So We answered his call, and We removed the distress that was on him, and We restored his family to him (that he had lost) and the like thereof along with them as a mercy from Ourselves and a Reminder for all those who worship Us.

source: وإسماعيل وإدريس وذا الكفل كل من الصابرين
en: And (remember) Isma'il (Ishmael), and Idris (Enoch) and Dhul-Kifl (Isaiah): all were from among As-Sabirun (the patient).

source: وأدخلناهم في رحمتنا إنهم من الصالحين
en: And We admitted them to Our Mercy. Verily, they were of the righteous.

source: وذا النون إذ ذهب مغاضبا فظن أن لن نقدر عليه فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين
en: And (remember) Dhun-Nun (Jonah), when he went off in anger, and imagined that We shall not punish him (i.e. the calamities which had befallen him)! But he cried through the darkness (saying): La ilaha illa Anta [none has the right to be worshipped but You (O, Allah)], Glorified (and Exalted) be You [above all that (evil) they associate with You]! Truly, I have been of the wrong-doers."

source: فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين
en: So We answered his call, and delivered him from the distress. And thus We do deliver the believers (who believe in the Oneness of Allah, abstain from evil and work righteousness).

source: وزكريا إذ نادى ربه رب لا تذرني فردا وأنت خير الوارثين
en: And (remember) Zakariyya (Zachariah), when he cried to his Lord: "O My Lord! Leave me not single (childless), though You are the Best of the inheritors."

source: فاستجبنا له ووهبنا له يحيى وأصلحنا له زوجه إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين
en: So We answered his call, and We bestowed upon him Yahya (John), and cured his wife (to bear a child) for him. Verily, they used to hasten on to do good deeds, and they used to call on Us with hope and fear, and used to humble themselves before Us.

source: والتي أحصنت فرجها فنفخنا فيها من روحنا وجعلناها وابنها آية للعالمين
en: And she who guarded her chastity [Virgin Maryam (Mary)]: We breathed into (the sleeves of) her (shirt or garment) [through Our Ruh - Jibril (Gabriel)], and We made her and her son ['Îsa (Jesus)] a sign for Al-'Alamin (the mankind and jinn).

source: إن هذه أمتكم أمة واحدة وأنا ربكم فاعبدون
en: Truly! This, your Ummah [Shari'ah or religion (Islamic Monotheism)] is one religion, and I am your Lord, therefore worship Me (Alone). [Tafsir Ibn Kathir]

source: وتقطعوا أمرهم بينهم كل إلينا راجعون
en: But they have broken up and differed as regards their religion among themselves. (And) they all shall return to Us.

source: فمن يعمل من الصالحات وهو مؤمن فلا كفران لسعيه وإنا له كاتبون
en: So whoever does righteous good deeds while he is a believer (in the Oneness of Allah - Islamic Monotheism), his efforts will not be rejected. Verily We record it for him (in his Book of deeds).

source: وحرام على قرية أهلكناها أنهم لا يرجعون
en: And a ban is laid on every town (population) which We have destroyed that they shall not return (to this world again, nor repent to Us).

source: حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون
en: Until, when Ya'juj and Ma'juj (Gog and Magog) are let loose (from their barrier), and they swoop down from every mound.

source: واقترب الوعد الحق فإذا هي شاخصة أبصار الذين كفروا يا ويلنا قد كنا في غفلة من هذا بل كنا ظالمين
en: And the true promise (Day of Resurrection) shall draw near (of fulfillment). Then (when mankind is resurrected from their graves), you shall see the eyes of the disbelievers fixedly staring in horror. (They will say): "Woe to us! We were indeed heedless of this - nay, but we were Zalimun (polytheists and wrong-doers)."

source: إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون
en: Certainly you (disbelievers) and that which you are worshipping now besides Allah, are (but) fuel for Hell! (Surely), you will enter it.

source: لو كان هؤلاء آلهة ما وردوها وكل فيها خالدون
en: Had these (idols) been alihah (gods), they would not have entered there (Hell), and all of them will abide therein.

source: لهم فيها زفير وهم فيها لا يسمعون
en: Therein they will be breathing out with deep sighs and roaring and therein they will hear not.

source: إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون
en: Verily, those for whom the good has preceded from Us, they will be removed far therefrom (Hell) [e.g. 'Îsa (Jesus), son of Maryam (Mary); 'Uzair (Ezra)].

source: لا يسمعون حسيسها وهم في ما اشتهت أنفسهم خالدون
en: They shall not hear the slightest sound of it (Hell), while they abide in that which their ownselves desire.

source: لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون
en: The greatest terror (on the Day of Resurrection) will not grieve them, and the angels will meet them, (with the greeting): "This is your Day which you were promised."

source: يوم نطوي السماء كطي السجل للكتب كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين
en: And (remember) the Day when We shall roll up the heaven like a scroll rolled up for books. As We began the first creation, We shall repeat it. (It is) a promise binding upon Us. Truly, We shall do it.

source: ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون
en: And indeed We have written in Az-Zabur [i.e. all the revealed Holy Books - the Taurat (Torah), the Injeel (Gospel), the Psalms, the Qur'an,] after (We have already written in) Al-Lauh Al-Mahfuz (the Book that is in the heaven with Allah), that My righteous slaves shall inherit the land (i.e. the land of Paradise).

source: إن في هذا لبلاغا لقوم عابدين
en: Verily, in this (the Qur'an) there is a plain Message for people who worship Allah (i.e. the true, real believers of Islamic Monotheism who act practically on the Qur'an and the Sunnah - legal ways of the Prophet صلى الله عليه وسلم).

source: وما أرسلناك إلا رحمة للعالمين
en: And We have sent you (O Muhammad صلى الله عليه وسلم): not but as a mercy for the 'Alamin (mankind, jinn and all that exists).

source: قل إنما يوحى إلي أنما إلهكم إله واحد فهل أنتم مسلمون
en: Say (O Muhammad صلى الله عليه وسلم): "It is revealed to me that your Ilah (God) is only one Ilah (God - Allah). Will you then submit to His Will (become Muslims and stop worshipping others besides Allah)?"
